Service - Payday Filing/Employment Information/sample messages/body-ei-returnprepop-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/Prepop</wsa:Action>
    </soap:Header>
    <soap:Body>
        <ret:Prepop xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnPrepopRequestMsg>
                <prep:PrepopRequestWrapper xmlns:prep="https://services.ird.govt.nz/GWS/Returns/:types/PrepopRequest">
                    <ei:retrieveEIRequest xmlns:ei="urn:www.ird.govt.nz/GWS:types/ReturnEI.v2">
                        <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                            <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                            <com:softwareRelease>1.0</com:softwareRelease>
                        </com:softwareProviderData>
                        <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2" IdentifierValueType="ACCIRD">123041607</com:identifier>
                        <com:accountType xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">PSO</com:accountType>
                        <ret1:periodEndDate xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">2018-04-30</ret1:periodEndDate>
                        <ret1:majorFormType xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">EI2</ret1:majorFormType>
                        <ei:payDayDate>2018-04-10</ei:payDayDate>
                    </ei:retrieveEIRequest>
                </prep:PrepopRequestWrapper>
            </ret:ReturnPrepopRequestMsg>
        </ret:Prepop>
    </soap:Body>
</soap:Envelope>